In addition post import i am seeing the following changes wanting to be made. is this expected?

# megaport_vxc.vxc_mcr_pol01 will be updated in-place
  ~ resource "megaport_vxc" "vxc_mcr_pol01" {
      ~ a_end                = {
          ~ current_product_uid   = "Secret" -> (known after apply)
          ~ location              = "Secret" -> (known after apply)
          ~ location_id           = 10 -> (known after apply)
          + ordered_vlan          = Secret
          ~ product_name          = "Secret" -> (known after apply)
          ~ requested_product_uid = "" -> "Secret"
          ~ vlan                  = Secret -> (known after apply)
            # (4 unchanged attributes hidden)
        }
      + a_end_partner_config = {
          + partner        = "vrouter"
          + vrouter_config = {
              + interfaces = [
                  + {
                      + ip_addresses = [
                          + "Secret",
                        ]
                      + ip_routes    = [
                          + {
                              + description = "Connection to "
                              + next_hop    = "Secret"
                              + prefix      = "Secret"
                            },
                        ]
                    },
                ]
            }
        }
      ~ b_end                = {
          ~ current_product_uid   = "Secret" -> (known after apply)
          + inner_vlan            = (known after apply)
          ~ location              = "Secret" -> (known after apply)
          ~ location_id           =Secret -> (known after apply)
          + ordered_vlan          = Secret
          ~ product_name          = "MegaPort" -> (known after apply)
          ~ requested_product_uid = "" -> "Secret"
          ~ vlan                  = Secret -> (known after apply)
            # (3 unchanged attributes hidden)
        }
      ~ contract_end_date    = "Secret" -> (known after apply)
      ~ contract_start_date  = "Secret" -> (known after apply)
      ~ create_date          = "Secret" -> (known after apply)
      + last_updated         = (known after apply)
      ~ live_date            = "Secret" -> (known after apply)
      ~ provisioning_status  = "LIVE" -> (known after apply)
        # (20 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.	 